-- MySQL dump 10.13  Distrib 8.0.29, for Win64 (x86_64)
--
-- Host: localhost    Database: test
-- ------------------------------------------------------
-- Server version	5.7.38-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `girgroup_kor`
--

DROP TABLE IF EXISTS `girgroup_kor`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `girgroup_kor` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `yearid` int(11) NOT NULL,
  `mem_id` int(11) DEFAULT '1',
  `debue_date` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `mem_name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `mem_eng_name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `img` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `updates` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=226 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `girgroup_kor`
--

LOCK TABLES `girgroup_kor` WRITE;
/*!40000 ALTER TABLE `girgroup_kor` DISABLE KEYS */;
INSERT INTO `girgroup_kor` VALUES (1,1,1,'1월 13일','드림캐쳐','Dreamcatcher',NULL,'2022-05-31 14:02:54'),(2,1,1,'3월 12일','이달의 소녀 1/3','LOOΠΔ 1/3; 유닛',NULL,'2022-05-31 14:02:54'),(3,1,1,'5월 16일','시크엔젤','Chic Angel',NULL,'2022-05-31 14:02:54'),(4,1,1,'6월 1일','앨리스','ELRIS',NULL,'2022-05-31 14:02:54'),(5,1,1,'6월 4일','그레이시','G-reyish',NULL,'2022-05-31 14:02:54'),(6,1,1,'8월 8일','위키미키','Weki Meki',NULL,'2022-05-31 14:02:54'),(7,1,1,'9월 21일','이달의소녀 오드아이써클','LOOΠΔ/ODD EYE CIRCLE; 유닛',NULL,'2022-05-31 14:02:54'),(8,1,1,'9월 27일','소녀주의보','Girls\' Alert',NULL,'2022-05-31 14:02:54'),(9,1,1,'11월 20일','헤이걸스','HEYGIRLS',NULL,'2022-05-31 14:02:54'),(10,1,1,'11월 22일','ABRY','에이브리',NULL,'2022-05-31 14:02:54'),(11,1,1,'11월 28일','버스터즈','Busters',NULL,'2022-05-31 14:02:54'),(100,2,1,'1월 12일','힌트','HINT',NULL,'2022-05-31 14:07:45'),(101,2,1,'1월 17일','비바 (VIVA)','VIVA',NULL,'2022-05-31 14:07:45'),(102,2,1,'1월 18일','프로미스나인','GIRLKIND',NULL,'2022-05-31 14:07:45'),(103,2,1,'1월 24일','오마이걸 반하나','fromis_9',NULL,'2022-05-31 14:07:45'),(104,2,1,'4월 2일','GBB','OH MY GIRL BANHANA[유닛]',NULL,'2022-05-31 14:07:45'),(105,2,1,'5월 1일','ii','지비비',NULL,'2022-05-31 14:07:45'),(106,2,1,'5월 2일','(여자)아이들','여자',NULL,'2022-05-31 14:07:45'),(107,2,1,'6월 7일','이달의 소녀 yyxy','LOOΠΔ yyxy[유닛]',NULL,'2022-05-31 14:07:45'),(108,2,1,'7월 18일','세러데이','Saturday',NULL,'2022-05-31 14:07:45'),(109,2,1,'8월 9일','열두달 (12DAL)','NATURE 12DAL',NULL,'2022-05-31 14:07:45'),(110,2,1,'8월 17일','이달의 소녀','네이처',NULL,'2022-05-31 14:07:45'),(111,2,1,'8월 23일','위걸스','LOOΠΔ',NULL,'2022-05-31 14:07:45'),(112,2,1,'9월 5일','공원소녀','We Girls',NULL,'2022-05-31 14:07:45'),(113,2,1,'9월 19일','퍼플','PURPLE',NULL,'2022-05-31 14:07:45'),(114,2,1,'10월 19일','탈리아 (Thalia)','핑크판타지 Thalia',NULL,'2022-05-31 14:07:45'),(115,2,1,'10월 25일','드림노트','PinkFantasy',NULL,'2022-05-31 14:07:45'),(116,2,1,'11월 7일','FANATICS-FLAVOR','DreamNote',NULL,'2022-05-31 14:07:45'),(117,2,1,'11월 27일','파나틱스-플레이버','파나틱스-플레이버[유닛]',NULL,'2022-05-31 14:07:45'),(118,3,1,'1월 11일','MUSKY','머스키',NULL,'2022-05-31 14:08:11'),(119,3,1,'1월 24일','체리블렛','CHERRY BULLET',NULL,'2022-05-31 14:08:11'),(120,3,1,'2월 12일','ITZY','있지',NULL,'2022-05-31 14:08:11'),(121,3,1,'2월 20일','핑크레이디','The Pink Lady',NULL,'2022-05-31 14:08:11'),(122,3,1,'3월 21일','EVERGLOW','에버글로우',NULL,'2022-05-31 14:08:11'),(123,3,1,'4월 11일','BVNDIT','밴디트',NULL,'2022-05-31 14:08:11'),(124,3,1,'4월 17일','핑크판타지 SHY','Pink Fantasy SHY[유닛]',NULL,'2022-05-31 14:08:11'),(125,3,1,'4월 18일','API','에이피아이',NULL,'2022-05-31 14:08:11'),(126,3,1,'5월 28일','3YE','써드아이',NULL,'2022-05-31 14:08:11'),(127,3,1,'6월 18일','듀자매 (Dew Sisters)','Dew Sisters',NULL,'2022-05-31 14:08:11'),(128,3,1,'6월 25일','러스티','PURPLE BECK',NULL,'2022-05-31 14:08:11'),(129,3,1,'7월 2일','락킷걸','Lusty',NULL,'2022-05-31 14:08:11'),(130,3,1,'7월 3일','비너스','Rockit Girl',NULL,'2022-05-31 14:08:11'),(131,3,1,'7월 9일','화이트데이 (White day)','White day',NULL,'2022-05-31 14:08:11'),(132,3,1,'8월 6일','로켓펀치','Venus',NULL,'2022-05-31 14:08:11'),(133,3,1,'8월 7일','걸카인드','Rocket Punch',NULL,'2022-05-31 14:08:11'),(134,3,1,'8월 30일','ARIAZ','GIRLKIND XJR[유닛]',NULL,'2022-05-31 14:08:11'),(135,3,1,'10월 24일','아리아즈','아리아즈',NULL,'2022-05-31 14:10:46'),(136,4,1,'1월 10일','프리즘','PRISM',NULL,'2022-05-31 14:10:46'),(137,4,1,'2월 4일','시그니처','CIGNATURE',NULL,'2022-05-31 14:10:46'),(138,4,1,'2월 11일','EPISODE','에피소드',NULL,'2022-05-31 14:10:46'),(139,4,1,'3월 6일','CRAXY','크랙시',NULL,'2022-05-31 14:10:46'),(140,4,1,'4월 17일','아이씨유','ICU',NULL,'2022-05-31 14:10:46'),(141,4,1,'4월 22일','KEEMBO','킴보',NULL,'2022-05-31 14:10:46'),(142,4,1,'5월 14일','woo!ah!','우아!',NULL,'2022-05-31 14:10:46'),(143,4,1,'5월 21일','SECRET NUMBER','시크릿넘버',NULL,'2022-05-31 14:10:46'),(144,4,1,'6월 30일','REDSQUARE','위클리',NULL,'2022-05-31 14:10:46'),(145,4,1,'7월 10일','Weeekly','Red Velvet - IRENE & SEULGI[유닛]',NULL,'2022-05-31 14:10:46'),(146,4,1,'7월 16일','레드벨벳-아이린&슬기','CHIC & IDLE',NULL,'2022-05-31 14:10:46'),(147,4,1,'8월 4일','시크한아이들','Maka Maka',NULL,'2022-05-31 14:10:46'),(148,4,1,'8월 11일','마카마카','FLORIA',NULL,'2022-05-31 14:10:46'),(149,4,1,'8월 26일','플로리아','보토패스',NULL,'2022-05-31 14:10:46'),(150,4,1,'9월 23일','별찌 (Byulzzi)','Byulzzi',NULL,'2022-05-31 14:10:46'),(151,4,1,'10월 8일','우주소녀 쪼꼬미','WJSN CHOCOME[유닛]',NULL,'2022-05-31 14:10:46'),(152,4,1,'10월 9일','큐빅스','Q6IX',NULL,'2022-05-31 14:10:46'),(153,4,1,'10월 23일','프레셔스','Precious',NULL,'2022-05-31 14:10:46'),(154,4,1,'10월 30일','블랙스완','Black Swan',NULL,'2022-05-31 14:10:46'),(155,4,1,'11월 12일','STAYC','스테이씨',NULL,'2022-05-31 14:10:46'),(156,4,1,'11월 17일','aespa','에스파',NULL,'2022-05-31 14:10:46'),(157,4,1,'2월 18일','블링블링','TRI.BE',NULL,'2022-05-31 14:10:46'),(158,4,1,'2월 25일','트라이비','픽시',NULL,'2022-05-31 14:10:46'),(159,4,1,'3월 15일','PIXY','PURPLE K!SS',NULL,'2022-05-31 14:10:46'),(160,4,1,'3월 26일','퍼플키스','메이져스',NULL,'2022-05-31 14:10:46'),(161,4,1,'5월 12일','MAJORS','WJSN THE BLACK[유닛]',NULL,'2022-05-31 14:10:46'),(162,4,1,'6월 2일','우주소녀 더 블랙','MINIMANI',NULL,'2022-05-31 14:10:46'),(163,4,1,'6월 10일','미니마니','라잇썸',NULL,'2022-05-31 14:10:46'),(164,4,1,'6월 26일','LIGHTSUM','MISS T',NULL,'2022-05-31 14:10:46'),(165,4,1,'8월 4일','미스티','SKYLE',NULL,'2022-05-31 14:10:46'),(166,4,1,'8월 6일','Rumble-G (럼블-G)','럼블-G',NULL,'2022-05-31 14:10:46'),(167,4,1,'8월 11일','Hi-L','하이엘',NULL,'2022-05-31 14:10:46'),(168,4,1,'8월 18일','파시걸스','PoshGirls',NULL,'2022-05-31 14:10:46'),(169,4,1,'8월 31일','프리티지','PRITTI-G',NULL,'2022-05-31 14:10:46'),(170,4,1,'9월 8일','ICHILLIN','아이칠린',NULL,'2022-05-31 14:10:46'),(171,4,1,'9월 23일','뷰티박스','BEAUTY BOX',NULL,'2022-05-31 14:10:46'),(172,4,1,'10월 14일','하이큐티','HI CUTIE',NULL,'2022-05-31 14:10:46'),(173,4,1,'10월 25일','bugAboo','버가부',NULL,'2022-05-31 14:10:46'),(174,4,1,'11월 11일','Billlie','빌리',NULL,'2022-05-31 14:10:46'),(175,4,1,'12월 1일','IVE','아이브',NULL,'2022-05-31 14:10:46'),(176,4,1,'12월 11일','lilli lilli','릴리릴리',NULL,'2022-05-31 14:10:46'),(177,4,1,'12월 14일','파스텔걸스','Pastel Girls',NULL,'2022-05-31 14:10:46'),(178,4,1,'1월 3일','Kep1er','케플러',NULL,'2022-05-31 14:10:46'),(179,4,1,'1월 5일','H1-KEY','하이키',NULL,'2022-05-31 14:10:46'),(180,4,1,'1월 7일','Rocking doll','록킹돌',NULL,'2022-05-31 14:10:46'),(181,4,1,'1월 27일','GOT the beat','갓 더 비트',NULL,'2022-05-31 14:10:46'),(182,4,1,'2월 9일','VIVIZ','비비지',NULL,'2022-05-31 14:10:46'),(183,4,1,'2월 22일','NMIXX','엔믹스',NULL,'2022-05-31 14:10:46'),(184,4,1,'4월 4일','ILY:1','아일리원',NULL,'2022-05-31 14:10:46'),(185,4,1,'5월 2일','LE SSERAFIM','르세라핌',NULL,'2022-05-31 14:10:46'),(186,4,1,'5월 5일','CLASS:y','클라씨',NULL,'2022-05-31 14:10:46'),(187,5,1,'2월 18일','트라이비','TRI.BE',NULL,'2022-05-31 14:13:08'),(188,5,1,'2월 25일','PIXY','픽시',NULL,'2022-05-31 14:13:08'),(189,5,1,'3월 15일','퍼플키스','PURPLE K!SS',NULL,'2022-05-31 14:13:08'),(190,5,1,'3월 26일','MAJORS','메이져스',NULL,'2022-05-31 14:13:08'),(191,5,1,'5월 12일','우주소녀 더 블랙','WJSN THE BLACK[유닛]',NULL,'2022-05-31 14:13:08'),(192,5,1,'6월 2일','미니마니','MINIMANI',NULL,'2022-05-31 14:13:08'),(193,5,1,'6월 10일','LIGHTSUM','라잇썸',NULL,'2022-05-31 14:13:08'),(194,5,1,'6월 26일','미스티','MISS T',NULL,'2022-05-31 14:13:08'),(195,5,1,'8월 4일','스카이리','SKYLE',NULL,'2022-05-31 14:13:08'),(196,5,1,'8월 6일','Rumble-G','럼블-G',NULL,'2022-05-31 14:13:08'),(197,5,1,'8월 11일','파시걸스','하이엘',NULL,'2022-05-31 14:13:08'),(198,5,1,'8월 18일','프리티지','PoshGirls',NULL,'2022-05-31 14:13:08'),(199,5,1,'8월 31일','ICHILLIN','PRITTI-G',NULL,'2022-05-31 14:13:08'),(200,5,1,'9월 8일','뷰티박스','아이칠린',NULL,'2022-05-31 14:13:08'),(201,5,1,'9월 23일','하이큐티','BEAUTY BOX',NULL,'2022-05-31 14:13:08'),(202,5,1,'10월 14일','bugAboo','HI CUTIE',NULL,'2022-05-31 14:13:08'),(203,5,1,'10월 25일','Billlie','버가부',NULL,'2022-05-31 14:13:08'),(204,5,1,'11월 11일','IVE','빌리',NULL,'2022-05-31 14:13:08'),(205,5,1,'12월 1일','lilli lilli','아이브',NULL,'2022-05-31 14:13:08'),(206,5,1,'12월 11일','파스텔걸스','릴리릴리',NULL,'2022-05-31 14:13:08'),(207,5,1,'12월 14일','Kep1er','Pastel Girls',NULL,'2022-05-31 14:13:08'),(208,5,1,'1월 3일','H1-KEY','케플러',NULL,'2022-05-31 14:13:08'),(209,5,1,'1월 5일','Rocking doll','하이키',NULL,'2022-05-31 14:13:08'),(210,5,1,'1월 7일','GOT the beat','록킹돌',NULL,'2022-05-31 14:13:08'),(211,5,1,'1월 27일','VIVIZ','갓 더 비트',NULL,'2022-05-31 14:13:08'),(212,5,1,'2월 9일','NMIXX','비비지',NULL,'2022-05-31 14:13:08'),(213,5,1,'2월 22일','ILY:1','엔믹스',NULL,'2022-05-31 14:13:08'),(214,5,1,'4월 4일','LE SSERAFIM','아일리원',NULL,'2022-05-31 14:13:08'),(215,5,1,'5월 2일','CLASS:y','르세라핌',NULL,'2022-05-31 14:13:08'),(216,5,1,'5월 5일','','클라씨',NULL,'2022-05-31 14:13:08'),(217,6,1,'1월 3일','Kep1er','케플러',NULL,'2022-05-31 14:13:08'),(218,6,1,'1월 5일','H1-KEY','하이키',NULL,'2022-05-31 14:13:08'),(219,6,1,'1월 7일','Rocking doll','록킹돌',NULL,'2022-05-31 14:13:08'),(220,6,1,'1월 27일','GOT the beat','갓 더 비트',NULL,'2022-05-31 14:13:08'),(221,6,1,'2월 9일','VIVIZ','비비지',NULL,'2022-05-31 14:13:08'),(222,6,1,'2월 22일','NMIXX','엔믹스',NULL,'2022-05-31 14:13:08'),(223,6,1,'4월 4일','ILY:1','아일리원',NULL,'2022-05-31 14:13:08'),(224,6,1,'5월 2일','LE SSERAFIM','르세라핌',NULL,'2022-05-31 14:13:08'),(225,6,1,'5월 5일','CLASS:y','클라씨',NULL,'2022-05-31 14:13:08');
/*!40000 ALTER TABLE `girgroup_kor` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-05-31 14:15:11
